---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewFamily
source: html/42644af9-9333-d862-e9da-a3ef877b0a9e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewFamily Property

"Family"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewFamily { get; }
```